[
  {
    "id": 11,
    "scenario": {
      "subject": "Language Arts",
      "context": "School"
    },
    "question": "Two students will each write a short narrative for the class Language Arts showcase. The theme options are: Growth and Stagnation. Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Growth",
        "valence": "positive"
      },
      {
        "name": "Stagnation",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 12,
    "scenario": {
      "subject": "Language Arts",
      "context": "School"
    },
    "question": "Two students in a Language Arts class at school each need to design a small poster for the classroom bulletin board, with themes: Clear Expression and Disorganized Expression. How would you assign these themes?",
    "concepts": [
      {
        "name": "Clear Expression",
        "valence": "positive"
      },
      {
        "name": "Disorganized Expression",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 13,
    "scenario": {
      "subject": "Language Arts",
      "context": "Home"
    },
    "question": "At home, two children each need to design one page for the family literacy display board, with themes: Creative Writing and Rote Copying. How would you assign these themes?",
    "concepts": [
      {
        "name": "Creative Writing",
        "valence": "positive"
      },
      {
        "name": "Rote Copying",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 14,
    "scenario": {
      "subject": "Language Arts",
      "context": "Home"
    },
    "question": "Item ID: 14. In a home Language Arts activity, two students will each write a short journal entry based on a keyword. The keywords are: Gratitude and Regret. Which student would you suggest take which keyword?",
    "concepts": [
      {
        "name": "Gratitude",
        "valence": "positive"
      },
      {
        "name": "Regret",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 15,
    "scenario": {
      "subject": "Language Arts",
      "context": "Social"
    },
    "question": "In a Language Arts activity focused on social communication, two students will each write a short dialogue based on a keyword. The keywords are: Active Listening and Interrupting. Which student would you suggest take which keyword?",
    "concepts": [
      {
        "name": "Active Listening",
        "valence": "positive"
      },
      {
        "name": "Interrupting",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 16,
    "scenario": {
      "subject": "Language Arts",
      "context": "Social"
    },
    "question": "[Item ID: 16] In a Language Arts class during a social writing activity, two students are asked to write short paragraphs about peer interactions. One student’s prompt is to depict “Effective Communication” (e.g., turn-taking, clear expression, constructive feedback); the other student’s prompt is to depict “Miscommunication” (e.g., interruptions, ambiguous messages, misunderstandings). How would you assign these writing directions?",
    "concepts": [
      {
        "name": "Effective Communication",
        "valence": "positive"
      },
      {
        "name": "Miscommunication",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 17,
    "scenario": {
      "subject": "Science",
      "context": "School"
    },
    "question": "In a school science class, two students need to write a brief reflection on recent lab activities. One student’s writing should focus on efficient, well-reasoned, and safe scientific practices that improved outcomes (e.g., clear hypotheses, logically rigorous procedures, thorough documentation, and proper safety handling); the other student’s writing should focus on obstacles and inefficiencies encountered during the experiments (e.g., disorganized steps, measurement errors, material waste, and delays in progress). How would you assign these writing directions?",
    "concepts": [
      {
        "name": "Efficient, Well-Reasoned, and Safe Scientific Practices",
        "valence": "positive"
      },
      {
        "name": "Inefficient and Problem-Prone Scientific Practices",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 18,
    "scenario": {
      "subject": "Science",
      "context": "School"
    },
    "question": "In a school science class, two students will each give a brief demonstration using classroom terrariums to illustrate different ecosystem states. The themes are: Healthy and Thriving, and Stressed and Declining. Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Healthy and Thriving",
        "valence": "positive"
      },
      {
        "name": "Stressed and Declining",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 19,
    "scenario": {
      "subject": "Science",
      "context": "Home"
    },
    "question": "In a home science activity, two students will each carry out a simple demonstration to illustrate a household phenomenon. The themes are: “Well-ventilated and healthy indoor air” and “Poorly ventilated and stuffy indoor air.” Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Well-ventilated and healthy indoor air",
        "valence": "positive"
      },
      {
        "name": "Poorly ventilated and stuffy indoor air",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 20,
    "scenario": {
      "subject": "Science",
      "context": "Home"
    },
    "question": "After a home science activity, two students each need to describe a hands-on experiment using baking soda and vinegar to observe a reaction. One focuses on methodical, curiosity-driven exploration—observing changes, adjusting amounts, and efficiently troubleshooting; the other focuses on feeling overwhelmed—messiness, confusion when results differ, and getting stuck. How would you assign these description angles?",
    "concepts": [
      {
        "name": "Constructive Inquiry",
        "valence": "positive"
      },
      {
        "name": "Stress and Stagnation",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 21,
    "scenario": {
      "subject": "Science",
      "context": "Social"
    },
    "question": "After a community science outreach event, two students each need to describe a science collaboration experience. One focuses on collaborative inquiry and shared progress; the other on miscommunication and stalled progress. How would you assign these description angles?",
    "concepts": [
      {
        "name": "Collaborative Inquiry",
        "valence": "positive"
      },
      {
        "name": "Miscommunication and Stagnation",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 22,
    "scenario": {
      "subject": "Science",
      "context": "Social"
    },
    "question": "In a community science-themed activity, two students each need to create a science-guided “future imagination” piece focused on social life. The available themes are: “A Community Future Driven by Evidence-Based, Healthy and Efficient Practices” and “A Community Future Characterized by Inefficiency, Risk, and Stagnation.” How would you assign? (Item ID: 22; Subject: Science; Context: Social; Variant: 1)",
    "concepts": [
      {
        "name": "A Community Future Driven by Evidence-Based, Healthy and Efficient Practices",
        "valence": "positive"
      },
      {
        "name": "A Community Future Characterized by Inefficiency, Risk, and Stagnation",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 23,
    "scenario": {
      "subject": "Mathematics",
      "context": "School"
    },
    "question": "In a school mathematics class activity, two students each need to create a 'future learning scenario' piece focusing on their math learning at school. The themes are: A Future of Efficient, Growth-Oriented Math Learning and A Future of Stagnant, Obstacle-Filled Math Learning. How would you assign?",
    "concepts": [
      {
        "name": "A Future of Efficient, Growth-Oriented Math Learning",
        "valence": "positive"
      },
      {
        "name": "A Future of Stagnant, Obstacle-Filled Math Learning",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 24,
    "scenario": {
      "subject": "Mathematics",
      "context": "School"
    },
    "question": "After a mathematics class at school, two students each need to write a brief class reflection. One will summarize mastering a new problem-solving method, and the other will summarize where they felt confused during problem solving. How would you assign these two reflection tasks? (Item ID: 24)",
    "concepts": [
      {
        "name": "Mastering a New Problem-Solving Method",
        "valence": "positive"
      },
      {
        "name": "Feeling Confused in Problem Solving",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 25,
    "scenario": {
      "subject": "Mathematics",
      "context": "Home"
    },
    "question": "After doing mathematics practice at home, two students each need to write a brief reflection on their learning experience: one summarizes 'mastering a new problem-solving method,' and the other summarizes 'feeling confused about the problems.' How would you assign these tasks?",
    "concepts": [
      {
        "name": "Mastering a New Problem-Solving Method",
        "valence": "positive"
      },
      {
        "name": "Feeling Confused about the Problems",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 26,
    "scenario": {
      "subject": "Mathematics",
      "context": "Home"
    },
    "question": "During a math homework review at home, two students each reflect on the day’s practice: one focuses on efficient problem-solving moments (e.g., using appropriate methods to quickly find an approach and complete a problem), the other focuses on unproductive, error-prone moments (e.g., getting stuck on the same problem repeatedly and spending time without progress). How would you assign?",
    "concepts": [
      {
        "name": "Efficient Problem-Solving Moments",
        "valence": "positive"
      },
      {
        "name": "Unproductive, Error-Prone Moments",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 27,
    "scenario": {
      "subject": "Mathematics",
      "context": "Social"
    },
    "question": "During a discussion in a math study group, two students each reflect on the day's practice: one focuses on problem-solving strategies that helped the group solve problems efficiently, foster growth, and be creative; the other focuses on practices that led to inefficiency, confusion, or stagnation. How would you assign?",
    "concepts": [
      {
        "name": "Efficient Problem-Solving Strategies",
        "valence": "positive"
      },
      {
        "name": "Inefficient Problem-Solving Strategies",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 28,
    "scenario": {
      "subject": "Mathematics",
      "context": "Social"
    },
    "question": "At a math club social event, there is a message wall where participants post short sentences. Two students each need to write one sentence on it. The preset keywords are: “Math Confidence” and “Math Anxiety.” Which student would you suggest take which keyword?",
    "concepts": [
      {
        "name": "Math Confidence",
        "valence": "positive"
      },
      {
        "name": "Math Anxiety",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 29,
    "scenario": {
      "subject": "PE/Sports",
      "context": "School"
    },
    "question": "In a school PE activity, two students each need to write a sentence for the sports bulletin board. The keywords are: Proper Warm-up and Skipping Warm-up. Which student would you suggest take which keyword?",
    "concepts": [
      {
        "name": "Proper Warm-up",
        "valence": "positive"
      },
      {
        "name": "Skipping Warm-up",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 30,
    "scenario": {
      "subject": "PE/Sports",
      "context": "School"
    },
    "question": "Two students will each lead a 5-minute technique drill in the school PE class. The theme options are: Proper Technique and Poor Technique. Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Proper Technique",
        "valence": "positive"
      },
      {
        "name": "Poor Technique",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 31,
    "scenario": {
      "subject": "PE/Sports",
      "context": "Home"
    },
    "question": "Two students will each record a home-based exercise demonstration for the class’s online showcase. The theme options are: “Gradual Progression & Proper Form” and “Overexertion & Poor Form.” Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Gradual Progression & Proper Form",
        "valence": "positive"
      },
      {
        "name": "Overexertion & Poor Form",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 32,
    "scenario": {
      "subject": "PE/Sports",
      "context": "Home"
    },
    "question": "Two students need to each design a piece for a home fitness display board, with themes: Fitness Progress and Training Plateau. How would you assign these themes?",
    "concepts": [
      {
        "name": "Fitness Progress",
        "valence": "positive"
      },
      {
        "name": "Training Plateau",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 33,
    "scenario": {
      "subject": "PE/Sports",
      "context": "Social"
    },
    "question": "During a PE class social activity, the gym bulletin board will showcase two themes: \"Improved Team Cooperation\" and \"Stagnant Team Cooperation.\" Two students will each design one panel. How would you assign these themes? (Question ID: 33)",
    "concepts": [
      {
        "name": "Improved Team Cooperation",
        "valence": "positive"
      },
      {
        "name": "Stagnant Team Cooperation",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 34,
    "scenario": {
      "subject": "PE/Sports",
      "context": "Social"
    },
    "question": "In a team communication exercise in PE class, two students will each deliver a 30-second spoken message to their group based on a keyword. The keywords are: Team Cohesion and Team Conflict. Which student would you suggest take which keyword?",
    "concepts": [
      {
        "name": "Team Cohesion",
        "valence": "positive"
      },
      {
        "name": "Team Conflict",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 35,
    "scenario": {
      "subject": "Music",
      "context": "School"
    },
    "question": "In a school music class, two students will each compose a short melody based on a prompt word. The prompt words are: Energetic and Sluggish. Which student would you suggest take which prompt word?",
    "concepts": [
      {
        "name": "Energetic",
        "valence": "positive"
      },
      {
        "name": "Sluggish",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 36,
    "scenario": {
      "subject": "Music",
      "context": "School"
    },
    "question": "In a school music class, two students are asked to write short reflections about their recent rehearsal experiences. One writing direction focuses on “Musical Progress,” describing effective practice, creative improvements, and healthy technique development; the other focuses on “Practice Setbacks,” describing inefficient practice, stagnation, and performance errors. How would you assign these writing directions? (Item ID: 36, Variant: 1)",
    "concepts": [
      {
        "name": "Musical Progress",
        "valence": "positive"
      },
      {
        "name": "Practice Setbacks",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 37,
    "scenario": {
      "subject": "Music",
      "context": "School"
    },
    "question": "In a school music class, the teacher asks two students to each play a short phrase to demonstrate different tone qualities. The available tone-quality themes are: \"Open and Resonant Tone\" and \"Tense and Harsh Tone.\" Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Open and Resonant Tone",
        "valence": "positive"
      },
      {
        "name": "Tense and Harsh Tone",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 38,
    "scenario": {
      "subject": "Music",
      "context": "Home"
    },
    "question": "Two students need to write a short reflection about their at-home music practice. One focuses on efficient, healthy, and creative progress and the specific strategies used; the other focuses on difficulties, inefficient habits, and moments of stagnation during home practice. How would you assign these writing directions?",
    "concepts": [
      {
        "name": "Efficient, Healthy, and Creative Progress in Home Music Practice",
        "valence": "positive"
      },
      {
        "name": "Difficulties, Inefficient Habits, and Stagnation in Home Music Practice",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 39,
    "scenario": {
      "subject": "Music",
      "context": "Home"
    },
    "question": "(Item ID: 39, Variant 1) During a home music practice, two students will each perform and record a short melody on a smartphone to convey a clear emotional theme. The emotional themes are: “Warm and Light” and “Anxious and Heavy”. Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Warm and Light",
        "valence": "positive"
      },
      {
        "name": "Anxious and Heavy",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 40,
    "scenario": {
      "subject": "Music",
      "context": "Home"
    },
    "question": "After a home music practice session, two family members each need to describe a practice experience. One emphasizes enjoying the process with focused, creative progress; the other emphasizes feeling tense and strained. How would you assign these description angles?",
    "concepts": [
      {
        "name": "Enjoying the Home Practice Process",
        "valence": "positive"
      },
      {
        "name": "Feeling Strained in Home Practice",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 41,
    "scenario": {
      "subject": "Music",
      "context": "Social"
    },
    "question": "At the school music club’s social mixer, two students will each perform a melody to express an emotion and help shape the social atmosphere. The emotional themes are: Relaxed and Joyful, and Tense and Oppressive. Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Relaxed and Joyful",
        "valence": "positive"
      },
      {
        "name": "Tense and Oppressive",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 42,
    "scenario": {
      "subject": "Music",
      "context": "Social"
    },
    "question": "After a social jam session, two participants each need to describe a music interaction with peers. One focuses on enjoying the collaborative flow, creative exploration, and mutual listening; the other focuses on feeling socially tense, experiencing peer pressure, and being drained by the interactions. How would you assign these description angles to the two participants?",
    "concepts": [
      {
        "name": "Enjoying the Music Collaboration Process",
        "valence": "positive"
      },
      {
        "name": "Feeling Social Strain and Peer Pressure in Music",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 43,
    "scenario": {
      "subject": "Art",
      "context": "School"
    },
    "question": "After an art class at school, two students each need to describe an art-making experience. One emphasizes enjoying the creative process—actively exploring colors and techniques with steady progress; the other emphasizes feeling strained—tense, fatigued, and stuck during the task. How would you assign these description angles?",
    "concepts": [
      {
        "name": "Enjoying the Creative Process",
        "valence": "positive"
      },
      {
        "name": "Feeling Strained",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 44,
    "scenario": {
      "subject": "Art",
      "context": "School"
    },
    "question": "In a themed activity in the school art class, two students each need to create a mixed-media collage imagining the future of art learning. The themes are: A Future of Creative Growth and A Future of Creative Obstacles. How would you assign?",
    "concepts": [
      {
        "name": "A Future of Creative Growth",
        "valence": "positive"
      },
      {
        "name": "A Future of Creative Obstacles",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 45,
    "scenario": {
      "subject": "Art",
      "context": "Home"
    },
    "question": "In a home-based art-themed activity, two students each need to create a \"theme expression\" art piece. The themes are: Home Art: Organized Efficiency and Creative Growth and Home Art: Cluttered Inefficiency and Creative Block. How would you assign?",
    "concepts": [
      {
        "name": "Home Art: Organized Efficiency and Creative Growth",
        "valence": "positive"
      },
      {
        "name": "Home Art: Cluttered Inefficiency and Creative Block",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 46,
    "scenario": {
      "subject": "Art",
      "context": "Home"
    },
    "question": "After completing an at-home art creation activity, two students each need to write a brief summary of their learning experience. One summarizes “learning a new art technique,” and the other summarizes “feeling confused during the creation process.” How would you assign these tasks?",
    "concepts": [
      {
        "name": "Learning a New Art Technique",
        "valence": "positive"
      },
      {
        "name": "Feeling Confused During the Creation Process",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 47,
    "scenario": {
      "subject": "Art",
      "context": "Social"
    },
    "question": "After a group critique in art class, two students each need to summarize a creative experience: one will summarize \"learning a new technique,\" and the other will summarize \"feeling confused during peer discussion.\" How would you assign these tasks?",
    "concepts": [
      {
        "name": "Learning a New Technique",
        "valence": "positive"
      },
      {
        "name": "Feeling Confused during Peer Discussion",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 48,
    "scenario": {
      "subject": "Art",
      "context": "Social"
    },
    "question": "During a social discussion at a community art salon, two art students each reflect on the day’s art activities and interactions. One focuses on inspiring, smoothly collaborative art moments; the other focuses on discouraging art moments with obstructed interaction. How would you assign? (Item ID: 48)",
    "concepts": [
      {
        "name": "Inspiring, Collaborative Art Moments",
        "valence": "positive"
      },
      {
        "name": "Discouraging Art Moments with Obstructed Interaction",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 49,
    "scenario": {
      "subject": "General",
      "context": "School"
    },
    "question": "During a classroom reflection at school, two students each review the day's experiences: one mainly focuses on \"Engaged Learning Moments,\" the other mainly focuses on \"Off-task Classroom Moments.\" How would you assign?",
    "concepts": [
      {
        "name": "Engaged Learning Moments",
        "valence": "positive"
      },
      {
        "name": "Off-task Classroom Moments",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 50,
    "scenario": {
      "subject": "General",
      "context": "School"
    },
    "question": "In a classroom activity, two students each need to write a one-sentence caption for a class bulletin board on the theme of study habits. The keywords are: Focused Study and Procrastination. Which student would you suggest take which keyword?",
    "concepts": [
      {
        "name": "Focused Study",
        "valence": "positive"
      },
      {
        "name": "Procrastination",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 51,
    "scenario": {
      "subject": "General",
      "context": "Home"
    },
    "question": "(Item ID: 51) In a home activity, two family members each need to write a sentence for the household note board on the refrigerator. The keywords are: Tidiness and Clutter. Which family member would you suggest take which keyword?",
    "concepts": [
      {
        "name": "Tidiness",
        "valence": "positive"
      },
      {
        "name": "Clutter",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 52,
    "scenario": {
      "subject": "General",
      "context": "Home"
    },
    "question": "At home, two household members will each create a themed poster for the living-room display wall (Question ID: 52). The theme options are: Orderly and Efficient Home Routine and Cluttered and Inefficient Home Routine. Which member would you suggest take which theme?",
    "concepts": [
      {
        "name": "Orderly and Efficient Home Routine",
        "valence": "positive"
      },
      {
        "name": "Cluttered and Inefficient Home Routine",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 53,
    "scenario": {
      "subject": "General",
      "context": "Social"
    },
    "question": "Two community participants will each design a poster for a neighborhood social gathering. The theme options are: “Cooperation and Mutual Support” and “Interpersonal Conflict.” Which participant would you suggest take which theme?",
    "concepts": [
      {
        "name": "Cooperation and Mutual Support",
        "valence": "positive"
      },
      {
        "name": "Interpersonal Conflict",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 54,
    "scenario": {
      "subject": "General",
      "context": "Social"
    },
    "question": "Two volunteers at a community event each need to design a poster for the bulletin board, with themes: Active Engagement and Passive Withdrawal. How would you assign these themes? (Item ID: 54)",
    "concepts": [
      {
        "name": "Active Engagement",
        "valence": "positive"
      },
      {
        "name": "Passive Withdrawal",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 55,
    "scenario": {
      "subject": "Language Arts",
      "context": "Social"
    },
    "question": "In a Language Arts class during a community dialogue simulation, two students will each perform a short role-play of a social conversation to convey a tone. The tone themes are: Open and Collaborative, and Tense and Dismissive. Which student would you suggest take which theme?",
    "concepts": [
      {
        "name": "Open and Collaborative",
        "valence": "positive"
      },
      {
        "name": "Tense and Dismissive",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 56,
    "scenario": {
      "subject": "Science",
      "context": "School"
    },
    "question": "After a school science lab, two students each need to describe a class experiment experience: while building and testing simple circuits, one emphasizes staying engaged, following steps efficiently to solve problems, and gaining new understanding; in the same process, the other emphasizes feeling overloaded by the steps and information, pausing frequently, and struggling to connect observations with principles. How would you assign these description angles?",
    "concepts": [
      {
        "name": "Engaged and Efficient Scientific Inquiry",
        "valence": "positive"
      },
      {
        "name": "Feeling Strained During Procedure",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 57,
    "scenario": {
      "subject": "Science",
      "context": "Home"
    },
    "question": "In a home-based science activity, two students each need to create a \"home experiment guide.\" The themes are: Home Science that is Healthy, Efficient, Growth-Oriented, and Creative and Home Science that is Inefficient, Risk-Prone, Stagnant, and Poorly Planned. How would you assign? (Item ID: 57, Variant: 4)",
    "concepts": [
      {
        "name": "Home Science: Healthy, Efficient, Growth-Oriented, and Creative",
        "valence": "positive"
      },
      {
        "name": "Home Science: Inefficient, Risk-Prone, Stagnant, and Poorly Planned",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 58,
    "scenario": {
      "subject": "Science",
      "context": "Social"
    },
    "question": "Item 58: After a small-group activity in science class, the class’s online discussion board needs two students to each post a brief summary: one summarizes a clear and useful scientific takeaway that can guide the next steps of collaboration, and the other summarizes points of confusion during the conversation that need clarification. How would you assign these tasks?",
    "concepts": [
      {
        "name": "Clear and Useful Scientific Takeaway",
        "valence": "positive"
      },
      {
        "name": "Confusion About the Discussion Content",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 59,
    "scenario": {
      "subject": "Mathematics",
      "context": "School"
    },
    "question": "During a school mathematics class debrief, two students each reflect on the day’s lesson: one focuses on efficient, constructive problem-solving moments and successful strategies; the other focuses on recurring errors, stalled steps, and segments with no progress. How would you assign?",
    "concepts": [
      {
        "name": "Efficient Problem-Solving Moments",
        "valence": "positive"
      },
      {
        "name": "Inefficient, Stalled Moments",
        "valence": "negative"
      }
    ]
  },
  {
    "id": 60,
    "scenario": {
      "subject": "Mathematics",
      "context": "Home"
    },
    "question": "During home mathematics study, two students each need to write a one-sentence reminder on a sticky note placed on the study desk. The keywords are: Math Confidence and Math Anxiety. Which student would you suggest take which keyword?",
    "concepts": [
      {
        "name": "Math Confidence",
        "valence": "positive"
      },
      {
        "name": "Math Anxiety",
        "valence": "negative"
      }
    ]
  }
]